OdBrepBuilder.setFaceColor(System.UInt32!System.Runtime.CompilerServices.IsLong!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,OdCmEntityColor!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Sets face color.
Return eNotApplicable if not supported in implementation or face color is part of material.

OdBrepBuilder.setEdgeColor(System.UInt32!System.Runtime.CompilerServices.IsLong!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,OdCmEntityColor!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Sets edge color.
Return value:
eNotApplicable if setEdgeColor not supported in implementation.
eInvalidInput if color method not supported in implementation.

OdBrepBuilder.setFaceMaterialMapping(System.UInt32!System.Runtime.CompilerServices.IsLong!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,OdGiMapper!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Sets material mapping for face.
Return eNotApplicable if not supported in implementation or material mapping is part of material.

OdBrepBuilder.addCoedge(System.UInt32!System.Runtime.CompilerServices.IsLong!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,System.UInt32!System.Runtime.CompilerServices.IsLong!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,OdBrepBuilder.EntityDirection,OdGeCurve2d!System.Runtime.CompilerServices.IsConst*)
\details
Add a co-edge associated to a previously added edge.
A co-edge represents the use of an edge on one of the edge's faces.
\remarks:
OdError(eInvalidInput) exception will be thrown if type of parametric curve(pParCur) is not supported by BrepBuilder implementation.